tutorials/fluidSolidInteraction/fillingElasticContainer/constant/fluid/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.3                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases
(
    water
    air
);

"water|phase1"
{
    transportModel  Newtonian;
    // nu              nu [ 0 2 -1 0 0 0 0 ] 1e-06;
    nu              nu [ 0 2 -1 0 0 0 0 ] 0.1; // 100 Pa s / 1000 kg m-3
    rho             rho [ 1 -3 0 0 0 0 0 ] 1000;
}

"air|phase2"
{
    transportModel  Newtonian;
    nu              nu [ 0 2 -1 0 0 0 0 ] 1.48e-05;
    rho             rho [ 1 -3 0 0 0 0 0 ] 1;
}

sigma           sigma [ 1 0 -2 0 0 0 0 ] 0.0; //0.07; // disable surface tension

// ************************************************************************* //
